<details ><summary>plan for oracle-network 2025-08-19 15:42:40 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#oracle-network has been locked by PR #13
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.vcn_shared.oci_core_internet_gateway.ig[0] will be created
  + resource "oci_core_internet_gateway" "ig" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "internet-gateway"
      + enabled        = true
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-singapore-1.amaaaaaadia3kqiafhukckcyaqjifyp3exolsx5btomrcejlxjqgr2k5xlza"
    }

  # module.vcn_shared.oci_core_route_table.ig[0] will be created
  + resource "oci_core_route_table" "ig" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabhm4uivzzdkeowpjp7kfcrdmp5ci7a4tthfxqjlbso7736kkeqma"
      + defined_tags   = (known after apply)
      + display_name   = "internet-route"
      + freeform_tags  = {
          + "module"      = "oracle-terraform-modules/vcn/oci"
          + "terraformed" = "Please do not edit manually"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-singapore-1.amaaaaaadia3kqiafhukckcyaqjifyp3exolsx5btomrcejlxjqgr2k5xlza"

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
          + destination       = "0.0.0.0/0"
          + destination_type  = (known after apply)
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>